package main

import "fmt"

/*
B/N * (B-1)/(N-1) = 1/2
2B(B-1) = N(N-1)
N(N-1) - 2B(B-1) = 0

N(N-1) = (N-1/2)^2-1/4
B(B-1) = (B-1/2)^2-1/4

(N-1/2)^2 - 1/4 - 2((B-1/2)^2-1/4) = 0
(N-1/2)^2 - 2(B-1/2)^2 + 1/4 = 0
(N-1/2)^2 - 2(B-1/2)^2 = -1/4
4(N-1/2)^2 - 2*4(B-1/2)^2 = -1
(2N-1)^2 - 2(2B-1)^2 = -1;  x^2 - 2y^2 = -1（负Pell方程的形式)
设x = 2N-1, y = 2B-1 ,   N = (x+1)/2, B = (y+1)/2
得到 x^2 - 2y^2 = -1
方程的基本解  x0 = 1, y0 = 1 , N = 1, B = 1, 不符合 (N>B)
设k = sqrt(2)
方程的通解 可以由 (x0 + y0*k)^n 得到,即不断乘以(1+k), 由于是负方程，刚好隔一个才出现一次，
即乘以 (1+k)^2, (1+k)^2 = 3+2k
(xi+yi*k)(3+2k) = 3xi+3*yi*k + 2xi*k + 2yi*2 = (3xi+4yi) + (2xi+3yi)*k
所以下一组解(x_i+1, y_i+1) = (3xi+4yi, 2xi+3yi)
(x0,y0) = (1,1) --> (N,B) = (1,1)
(x1,y1) = (7,5) --> (N,B) = (4,3)
(x2,y2) = (41,29) --> (N,B) = (21,15)
(x3,y3) = (239,169) --> (N,B) = (120,85)
*/
func main() {
	x, y := int64(1), int64(1)
	for {
		x, y = 3*x+4*y, 2*x+3*y
		N, B := (x+1)/2, (y+1)/2
		fmt.Printf("x=%d, y=%d, N=%d, B=%d\n", x, y, N, B)
		if N >= 1000000000000 {
			// 验算
			a := 2 * B * (B - 1)
			b := N * (N - 1)
			fmt.Printf("a=%d, b=%d, a==b = %v\n", a, b, a == b)

			break
		}
	}
}
