package main

import "fmt"

/*
http://projecteuler.net/problem=138

设b = 2a,
h^2 + a^2 = L^2

h = 2a+1 or h = 2a-1
情况1: h = 2a+1

(2a+1)^2 + a^2 = L^2
5a^2 + 4a + 1 = L^2
25a^2 + 20a + 5 = 5L^2
(5a+2)^2 + 1 = 5L^2
(5a+2)^2 - 5L^2 = -1

设x = 5a+2, y = L, 得到一个负佩尔方程
x^2 - 5y^2 = -1

情况2: h = 2a-1
(2a-1)^2 + a^2 = L^2
5a^2 - 4a + 1 = L^2
25a^2 - 20a + 5 = 5L^2
(5a-2)^2 + 1 = 5L^2
(5a-2)^2 - 5L^2 = -1
设x = 5a-2, y = L, 得到一个负佩尔方程
x^2 - 5y^2 = -1

所以只要解出负佩尔方程的解即可，可以推出L = y

x^2 - 5y^2 = -1
枚举找最小基础解
(x,y) = (2,1)
基本单位 2+√5, 它的范数 = 4-5 = -1， 所以其他解可以由它的奇数次幂得到
(2+√5)^2 = 9 + 4√5

(u+v√5)(9+4√5) = 9u+20v + (4u+9v)√5

u' = 9u+20v
v' = 4u+9v

(2,1) --> (9*2+20*1, 4*2+9*1): (38, 17)

*/

func main() {
	// 第一组解（38，17）， 对应的a,L: 8,17
	sum := int64(0)
	u, v := int64(38), int64(17)
	k := 0
	for {
		fmt.Printf("%d %d\n", u, v)
		sum += v
		u, v = 9*u+20*v, 4*u+9*v
		k++
		if k == 12 {
			break
		}
	}
	fmt.Printf("sum=%d\n", sum)
}
