package main

import "fmt"

/*
http://projecteuler.net/problem=139

a^2 + b^2 = c^2

假设 a < b < c

四个直角三角形 + 中间的正方形可以组成一个边长为c的正方形。
要求c可以由中间的正方形组成,即 c 必须被 b-a整除

设d=b-a, c = kd

a^2 + b^2 = c^2
a^2 + b^2 + a^2 + b^2 = 2c^2
(a+b)^2 + (b-a)^2 = 2c^2
(a+b)^2 + d^2 = 2k^d^2

(a+b)^2 = (2k^2-1)d^2

所以2k^2-1必须是一个完全平方数，假设是x^2
即 2k^2-1 = x^2

x^2 - 2k^2 = -1, 设y=k, 可得负佩尔方程

x^2 - 2y^2 = -1

a+b = xd
b-a = d

a = d * (x-1)/2
b = d * (x+1)/2
c = d * y

三角形的周长P = a+b+c = d * (x+y)
解佩尔方程，同时约束条件是P<100000000, d(x+y)<=99,999,999, 所以可以取的个数是 99,999,999 // (x+y)个， （//表示整数除法）

枚举佩尔方程基础解
(x,y) = (1,1)

标准佩尔方程 x^2 - 2y^2 = 1
标准佩尔方程的基本解 x0 = 3, y0 = 2
所以基本单位是 3+2√2
(1+√2)*(1+√2) = 3+2√2

设u,v是负佩尔方程的一组解，求递推公式
(u+v√2)*(3+2√2) = (3u+4v) + (2u+3v)√2
u' = 3u+4v
v' = 2u+3v

(1,1) --> (7,5) (第一个直角三角形)
*/

func main() {
	M := int64(100000000)
	u, v := int64(7), int64(5)
	sum := int64(0)
	for {
		if u+v > M {
			break
		}
		fmt.Printf("%d %d\n", u, v)
		sum += (M - 1) / (u + v)
		u, v = 3*u+4*v, 2*u+3*v
	}
	fmt.Printf("sum=%d\n", sum)
}
