package main

import "fmt"

/*
http://projecteuler.net/problem=148
杨辉三角中，不能被7整除的数字的个数

要计算前10^9行

                   1
		  1 1
		 1 2 1
		1 3 3 1
	       1 4 6 4 1
	      1 5 10 10 5 1
	     1 6 15 20 15 6 1
	    1 7 21 35 35 21 7 1
	   1 8 28 56 70 56 28 8 1
	  1 9 36 84 126 126 84 36 9 1
	 1 10 45 120 210 252 210 120 45 10 1
卢卡斯定理和整除性

第n行，第k项 = C(n,k) 组合数 n从0开始, 0<=k<=n
对于任意的素数p, 把n,k表示为p进制数
n = n_m*p^m + n_(m-1)*p^(m-1) + ... + n_1*p + n_0
k = k_m*p^m + k_(m-1)*p^(m-1) + ... + k_1*p + k_0

(1+x)^p = 1 + x^p (mod p)
(1+x)^p 二项式展开
= 1 + C(p,1)*x + C(p,2)*x^2 + ... + C(p,p-1)*x^(p-1) + x^p
中间的组合数C(p,i) = p!/(i!*(p-i)!), 由于p是素数，所以分子中的p无法被下面的分母约掉，所以C(p,i)一定能够被p整除
所以在模p的情况下，(1+x)^p = 1 + x^p (mod p)

推广到p的更高次也成立

(1+x)^(p^2) = 1 + x^(p^2) (mod p)
(1+x)^(p^3) = 1 + x^(p^3) (mod p)

证明：
(1+x)^(p^2) = [(1+x)^p]^p (mod p)
将 (1+x)^p = 1 + x^p (mod p) 带入中括号内部的部分，得到
(1+x)^(p^2) = (1+x^p)^p (mod p)
将x^p是做一个整体，再次应用上面的结论，得到
(1+x)^(p^2) = (1+x^p)^p = 1 + (x^p)^p = 1 + x^(p^2) (mod p)
同理，可以推广到p的更高次
(1+x)^(p^i) = 1 + x^(p^i) (mod p)


目标: 计算C(n,k) (mod p)
(1+x)^n, 二项式展开，可以得到 x^k 的系数为C(n,k)

将n表示为p进制数：
n = n_m*p^m + n_(m-1)*p^(m-1) + ... + n_1*p + n_0
其中n0,n1,n2,...,n_m都是0到p-1的整数

(1+x)^n = (1+x)^(n_m*p^m + n_(m-1)*p^(m-1) + ... + n_1*p + n_0)

指数的乘法法则
x^(a+b) = x^a * x^b
x^(a*b) = (x^a)^b

(1+x)^n = (1+x)^(n_m*p^m + n_(m-1)*p^(m-1) + ... + n_1*p + n_0)
        = (1+x)^n_0 * (1+x)^(n_1*p) * (1+x)^(n_2*p^2) * ... * (1+x)^(n_m*p^m)
	= (1+x)^n_0 * [(1+x)^p]^n_1 * [(1+x)^(p^2)]^n_2 * ... * [(1+x)^(p^m)]^n_m
在（mod p)的情况下，根据上面的结论 (1+x)^(p^i) = 1 + x^(p^i) (mod p) 带入可得


(1+x)^n = (1+x)^n_0 * (1+x^p)^n_1 * (1+x^(p^2))^n_2 * ... * (1+x^(p^m))^n_m  (mod p)

将等式右边的每一项展开
(a+b)^m = ∑C(m,j)*a^j*b^(m-j)
第一个二项式 = ∑C(n0,j0)*(x^j0)
第二个二项式 = ∑C(n1,j1)*(x^j1)
第三个二项式 = ∑C(n2,j2)*(x^j2)
...
第m个二项式 = ∑C(nm,jm)*(x^jm)

原式 = 以上各个多项式的乘积,  然后考虑x^k的系数
k个x肯定来自以上个式子，总指数=k
j0 + j1*p + j2*p^2 + ... + jm*p^m = k
也就是k的p进制表示
k = k_m*p^m + k_(m-1)*p^(m-1) + ... + k_1*p + k_0
由于k在p进制下表示具有唯一性，
所以这里j0 = k0,j1=k1,..., jm=km
因此 x^k的系数为C(n0,k0)*C(n1,k1)*C(n2,k2)*...*C(nm,km)

所以x^k的系数也是C(n,k)
C(n,k) = C(n0,k0)*C(n1,k1)*C(n2,k2)*...*C(nm,km) (mod p)

上式就是卢卡斯定理


考察第n行，不能被7整除的个数，第n行的每一个数

C(n,k), 0<=k<=n
C(n,k) != 0 (mod 7)
C(n,k) = C(n0,k0)*C(n1,k1)*C(n2,k2)*...*C(nm,km) != 0 (mod 7)  7进制
不等于0，所以这里的每一项C(ni,ki) != 0 (mod 7)
ni,ki 在0--6之间的整数
当ki>ni时，C(ni,ki) = 0， 所以此时 C(ni,ki) = 0 (mod 7)
当ki<=ni时，C(ni,ki) = ni!/(ki!*(ni-ki)!)， 由于ni<7, ki<7, 所以这里的结果一定不包含7的因子，所以一定不能被7整除
因此 C(ni,ki) != 0 (mod 7)

所以C(n,k) != 0 (mod 7), 必须让每一个ki<=ni
对于固定的n，n的7进制数表示 n0, n1, n2, ..., nm是固定的。
那有多少个k满足 C(n,k) != 0 (mod 7) ?
k的7进制数表示 k0, k1, k2, ..., km
要求k0<=n0, k1<=n1, k2<=n2, ..., km<=nm
所以k0可以取 0, 1, 2, ..., n0   (n0+1)个
k1可以取 0,1,2, ..., n1   (n1+1)个
....
km 可以取 0,1,2, ..., nm   (nm+1)个
所以k的个数为 (n0+1)*(n1+1)*(n2+1)*...*(nm+1)

因此k的个数为 (n0+1)*(n1+1)*(n2+1)*...*(nm+1)，也就是第n行，不能被7整除的个数

现在我们需要求前n行所有的不能被7整除的个数，
行号从0开始，到n-1

设n = a * 7^k + R, (7进制度下最高位a, 低位R)
分类求解
最高位是0,1,2,...,a-1的时候，后面的k位可以从0到6
(1+2+...+a)*28^k = (a*(a+1)/2) * 28^k
其中28 = (0+1)+(1+1)+(2+1)+...+(6+1), 代表某一位可以取0,1,2,3,4,5,6的所有情况下的个数

最高位固定是a的情况下，
后面的位可以从0到R-1, 刚好是前R行
(a+1) * f(R)



*/

func main() {
	n := 1e9
	total := f(int64(n))
	fmt.Printf("total = %d\n", total)
}

func f(n int64) int64 {
	if n == 0 {
		return 0
	}
	// 分解 n = a*7^k + r
	p := int64(1)
	k := 0
	for p*7 <= n {
		p *= 7
		k++
	}

	a := n / p
	r := n % p
	fmt.Printf("%d = %d*7^%d + %d\n", n, a, k, r)
	return a*(a+1)*pow28(k)/2 + (a+1)*f(r)
}

func pow28(k int) int64 {
	if k == 0 {
		return 1
	}
	if k%2 == 0 {
		v := pow28(k / 2)
		return v * v
	}
	return 28 * pow28(k-1)
}
