package main

/*

https://projecteuler.net/problem=176

枚举勾股数

A = m^2 - n^2
B = 2mn
C = m^2 + n^2

--> A^2 + B^2 = C^2
m从1到N，n从m-1到1, gcd(m,n)=1


打表记录出现的次数？？

分析：如果一个数A，存在47547中不同的情况，使得A^2 + B^2 = C^2

A^2 = C^2 - B^2 = (C+B)*(C-B)
对A^2进行分解, 假设A^2 = p*q, 可以得到C = (p+q)/2, B=(p-q)/2, 假设p>q

比如A=4, A^2 = 16,
16 = 1*16  --> p=16, q=1, C=8.5, B=7.5 舍去
   = 2*8   --> p=8, q=2, C=5, B=3 符合
   = 4*4   --> p=4, q=4, C=2, B=0 舍去

比如A=12, A^2 = 144,
144 = 1*144 --> p=144, q=1, C=12.5, B=10.5 舍去
   = 2*72  --> p=72, q=2, C=37, B=35 符合
   = 3*48  --> p=48, q=3, C=25.5 舍去
   = 4*36  --> p=36, q=4, C=20, B=16 符合
   = 6*24  --> p=24, q=6, C=15, B=9 符合
   = 8*18  --> p=18, q=8, C=13, B=5 符合
   = 9*16  --> p=16, q=9, C=12.5, B=3.5 舍去
   = 12*12 --> p=12, q=12, C=12, B=0 舍去

d(n) = n的约数个数

如果A是偶数的话，满足条件的p,q都是偶数，设p=2p',q=2q', 任意一对(p',q')都可以还原为(p,q)
p'*q' = A^2/4
所以最后的结果数 = (d(A^2/4)-1)/2



比如A=15, A^2=225,
225 = 1*225 --> p=225, q=1, C=113, B=112
    = 3*75  --> p=75, q=3, C=39, B=36
    = 5*45  --> p=45, q=5, C=25, B=20
    = 9*25  --> p=25, q=9, C=18, B=8
    = 15*15 --> p=15, q=15, C=15, B=0 舍去

最后的结果数 = (d(A^2)-1)/2

总结一下，A^2因子分解为p*q, p!=q, 并且p,q同奇同偶, 如果A是偶数，p,q都是偶数

现在假设A^2,分解之后可以得到47547中不同的情况, 要求最小的A

d(n) = (k0+1)(k1+1)...(km+1), 假设n=a0^k0 * a1^k1 * ... * am^km

A应该是偶数，这样可以将因子个数尽量分配给2，导致整体结果更小

d(A^2/4) - 1 / 2 = N
d(A^2/4) = 2N + 1 = 2*47547+1 = 95095 = 5 * 7 * 11 * 13 * 19

2对应的指数部分贡献最多 = 19
2 --> 19
3 --> 13
5 --> 11
7 --> 7
11 --> 5

A^2 = 2^20 * 3^12 * 5^10 * 7^6 * 11^4
A = 2^10 * 3^6 * 5^5 * 7^3 * 11^2 = 96,818,198,400,000




*/

func main() {

}
